<a href="https://colab.research.google.com/github/anubhavgupta1/Data---Science/blob/main/PandasDataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!ls
!apt-get install -y -qq software-properties-common python-software-properties module-init-tools
!add-apt-repository -y ppa:alessandro-strada/ppa 2>&1 > /dev/null
!apt-get update -qq 2>&1 > /dev/null
!apt-get -y install -qq google-drive-ocamlfuse fuse
from google.colab import auth
auth.authenticate_user()
from oauth2client.client import GoogleCredentials
creds = GoogleCredentials.get_application_default()
import getpass
!google-drive-ocamlfuse -headless -id={creds.client_id} -secret={creds.client_secret} < /dev/null 2>&1 | grep URL
vcode = getpass.getpass()
!echo {vcode} | google-drive-ocamlfuse -headless -id={creds.client_id} -secret={creds.client_secret}


!mkdir -p drive
!google-drive-ocamlfuse drive

import os
os.chdir ("drive/Udacity/data science/")
!ls

sample_data
E: Package 'python-software-properties' has no installation candidate
Selecting previously unselected package google-drive-ocamlfuse.
(Reading database ... 160983 files and directories currently installed.)
Preparing to unpack .../google-drive-ocamlfuse_0.7.26-0ubuntu1~ubuntu18.04.1_amd64.deb ...
Unpacking google-drive-ocamlfuse (0.7.26-0ubuntu1~ubuntu18.04.1) ...
Setting up google-drive-ocamlfuse (0.7.26-0ubuntu1~ubuntu18.04.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Please, open the following URL in a web browser: https://accounts.google.com/o/oauth2/auth?client_id=32555940559.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive&response_type=code&access_type=offline&approval_prompt=force
··········
Please, open the following URL in a web browser: https://accounts.google.com/o/oauth2/auth?client_id=32555940559.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive&response_type=code&access_type=offline&approval_prompt=force
Please enter the verification code: Access token retrieved correctly.
cric_data.tsv		  NIFTY50_2018.csv	planets_new.txt       zeros.npz
many_arrs_compressed.npz  NIFTY50_2019.csv	planets_small.txt
many_arrs.npz		  NIFTYNext50_2019.csv	planets.txt
nifty-200623-235920.csv   planets_new.npy	zeros_compressed.npz

In [2]:
import numpy as np
import pandas as pd

## Creating dataframe objects

In [3]:
arr = np.random.randint(0, 10, (5, 3))
df = pd.DataFrame(arr)
df

   0  1  2
0  1  4  2
1  8  6  8
2  8  5  8
3  5  9  0
4  5  8  7

In [4]:
df.values

array([[1, 4, 2],
       [8, 6, 8],
       [8, 5, 8],
       [5, 9, 0],
       [5, 8, 7]])

In [5]:
df.index = ["R1","R2","R3", "R4", "R5"]
df.columns = ["C1","C2","C3"]
df

    C1  C2  C3
R1   1   4   2
R2   8   6   8
R3   8   5   8
R4   5   9   0
R5   5   8   7

In [6]:
df.values[0]

array([1, 4, 2])

## Explicit

In [7]:
df.loc["R3", "C2"]

5

## Implicit

In [8]:
df.iloc[2, 1]

5

## Slice

In [9]:
df.loc['R3':'R5', 'C2':'C3']

    C2  C3
R3   5   8
R4   9   0
R5   8   7

In [10]:
df

    C1  C2  C3
R1   1   4   2
R2   8   6   8
R3   8   5   8
R4   5   9   0
R5   5   8   7

## iloc for rows

In [11]:
df.iloc[0]

C1    1
C2    4
C3    2
Name: R1, dtype: int64

## iloc for rows and cols

In [12]:
df.iloc[:, 0]

R1    1
R2    8
R3    8
R4    5
R5    5
Name: C1, dtype: int64

In [13]:
def create_df(nRows, nCols, maxRand=10):
    arr = np.random.randint(0, maxRand, (nRows, nCols))
    df = pd.DataFrame(arr)
    df.index = ['R' + str(x) for x in np.arange(1, nRows+1)]
    df.columns = ['C' + str(x) for x in np.arange(1, nCols+1)]
    return df

In [14]:
create_df(5, 3)

    C1  C2  C3
R1   5   5   2
R2   1   2   5
R3   5   5   2
R4   7   4   1
R5   7   8   2

In [15]:
df.loc["R1"]

C1    1
C2    4
C3    2
Name: R1, dtype: int64

In [16]:
df.loc[:, "C1"]

R1    1
R2    8
R3    8
R4    5
R5    5
Name: C1, dtype: int64

In [17]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [18]:
dict1 = {'Mass': mass, 'Diameter': diameter}
print(type(dict1))

<class 'dict'>

In [19]:
df = pd.DataFrame(dict1)
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [20]:
df["Mass"]

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [21]:
df["Mass"]["Earth"]

5.97

In [22]:
df.Mass.Earth

5.97

In [23]:
df['pop'] = 0
df

              Mass  Diameter  pop
Earth       5.9700     12756    0
Jupiter  1898.0000    142984    0
Mars        0.6420      6792    0
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [24]:
df["pop"]["Earth"]  = 8000000000
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

              Mass  Diameter         pop
Earth       5.9700     12756  8000000000
Jupiter  1898.0000    142984           0
Mars        0.6420      6792           0
Mercury     0.3300      4879           0
Moon           NaN      3475           0
Neptune   102.0000     49528           0
Pluto       0.0146      2370           0
Saturn    568.0000    120536           0
Uranus     86.8000     51118           0
Venus       4.8700     12104           0

In [25]:
print(df.Mass is df["Mass"])
print(df.pop is df["pop"])

True
False

In [26]:
df

              Mass  Diameter         pop
Earth       5.9700     12756  8000000000
Jupiter  1898.0000    142984           0
Mars        0.6420      6792           0
Mercury     0.3300      4879           0
Moon           NaN      3475           0
Neptune   102.0000     49528           0
Pluto       0.0146      2370           0
Saturn    568.0000    120536           0
Uranus     86.8000     51118           0
Venus       4.8700     12104           0

In [27]:
np.mean(df['Mass'])

296.29184444444445

In [28]:
df

              Mass  Diameter         pop
Earth       5.9700     12756  8000000000
Jupiter  1898.0000    142984           0
Mars        0.6420      6792           0
Mercury     0.3300      4879           0
Moon           NaN      3475           0
Neptune   102.0000     49528           0
Pluto       0.0146      2370           0
Saturn    568.0000    120536           0
Uranus     86.8000     51118           0
Venus       4.8700     12104           0

In [29]:
df.loc["Col_mean"] = 0
df

               Mass  Diameter         pop
Earth        5.9700     12756  8000000000
Jupiter   1898.0000    142984           0
Mars         0.6420      6792           0
Mercury      0.3300      4879           0
Moon            NaN      3475           0
Neptune    102.0000     49528           0
Pluto        0.0146      2370           0
Saturn     568.0000    120536           0
Uranus      86.8000     51118           0
Venus        4.8700     12104           0
Col_mean     0.0000         0           0

In [30]:
 df.loc["Col_mean"] = np.mean(df).values
 df

                Mass       Diameter           pop
Earth        5.97000   12756.000000  8.000000e+09
Jupiter   1898.00000  142984.000000  0.000000e+00
Mars         0.64200    6792.000000  0.000000e+00
Mercury      0.33000    4879.000000  0.000000e+00
Moon             NaN    3475.000000  0.000000e+00
Neptune    102.00000   49528.000000  0.000000e+00
Pluto        0.01460    2370.000000  0.000000e+00
Saturn     568.00000  120536.000000  0.000000e+00
Uranus      86.80000   51118.000000  0.000000e+00
Venus        4.87000   12104.000000  0.000000e+00
Col_mean   266.66266   36958.363636  7.272727e+08

In [31]:
df.drop('Col_mean', inplace=True)
df.drop('pop', axis=1, inplace=True)
df

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [32]:
df.loc["Col_mean"] = np.mean(df).values
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_mean   296.291844   40654.2

In [33]:
df = create_df(5, 3)
df

    C1  C2  C3
R1   3   9   0
R2   3   8   2
R3   8   7   2
R4   6   2   4
R5   8   3   0

In [34]:
df.loc["Col_Mean"] = np.mean(df).values
df["Row_mean"] = np.mean(df, axis=1).values
df

           C1   C2   C3  Row_mean
R1        3.0  9.0  0.0  4.000000
R2        3.0  8.0  2.0  4.333333
R3        8.0  7.0  2.0  5.666667
R4        6.0  2.0  4.0  4.000000
R5        8.0  3.0  0.0  3.666667
Col_Mean  5.6  5.8  1.6  4.333333

In [35]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
dict1 = {'mass': mass, 'diameter': diameter}
planets = pd.DataFrame(dict1)
planets.describe()

              mass      diameter
count     9.000000      10.00000
mean    296.291844   40654.20000
std     627.786429   51541.39142
min       0.014600    2370.00000
25%       0.642000    5357.25000
50%       5.970000   12430.00000
75%     102.000000   50720.50000
max    1898.000000  142984.00000

In [36]:
import seaborn as sns

In [37]:
planets = sns.load_dataset('planets')

In [38]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [39]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

## Go through each row of the dataframe and delete it (drop) if any of the columns is null

In [40]:
planets.dropna(inplace=True)
planets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 498 entries, 0 to 784
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          498 non-null    object
 1   number          498 non-null    int64
 2   orbital_period  498 non-null    float64
 3   mass            498 non-null    float64
 4   distance        498 non-null    float64
 5   year            498 non-null    int64
dtypes: float64(3), int64(2), object(1)
memory usage: 27.2+ KB

## Filter and show only those rows which have 
* planets that are found in the 2010s and 
* method is 'Radial Velocity' or 'Transit' and 
* distance is large (> 75 percentile)

In [41]:
df_ = planets.copy()
per_75 = df_.distance.quantile(0.75)
df_ = df_[
    (df_['year'] >= 2010) &
    ((df_['method'] == 'Radial Velocity') | (df_['method'] == 'Transit')) &
    (df_['distance'] > per_75)
]

In [42]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

## Modify the method column to have only the abbreviation of each method

In [43]:
planets = sns.load_dataset('planets')

In [44]:
planets.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [45]:
short_names = {}
for s in planets.method.unique():
    short_names[s] = ''.join([x[0] for x in s.split(' ')])

In [46]:
print(short_names)

{'Radial Velocity': 'RV', 'Imaging': 'I', 'Eclipse Timing Variations': 'ETV', 'Transit': 'T', 'Astrometry': 'A', 'Transit Timing Variations': 'TTV', 'Orbital Brightness Modulation': 'OBM', 'Microlensing': 'M', 'Pulsar Timing': 'PT', 'Pulsation Timing Variations': 'PTV'}

In [47]:
for i, r in planets.iterrows():
    planets.loc[i, 'short_method'] = short_names.get(r['method'], r['method'])

In [48]:
planets.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

In [49]:
df = sns.load_dataset('planets')

In [50]:
def shorten_method(s):
    return short_names.get(s, s)

In [51]:
df['short_method'] = df['method'].apply(shorten_method)

In [52]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

##Count the number of planets discovered for each method type

1. Split the dataframe into smaller chunks (in this case they should have the same method name)
2. Apply some function in each smaller chunk (in this case it is the count function)
3. Aggregate the results from each chunk together

In [53]:
planets.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

## Find out what fraction of planets have been found in the last decade (i.e., in 2010s) across each method type

1. Filter the data for given condition (in this case planet found in last decade)
2. Split (in this case across method)
3. Apply (in this case just count)
4. Aggregate (to represent the final result)

In [54]:
planets = sns.load_dataset('planets')

In [55]:
series_2010s = planets[planets["year"] >= 2010].groupby("method")["method"].count()
series_all_time = planets.groupby('method')['method'].count()

In [56]:
series_2010s/series_all_time

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

In [57]:
!ls

cric_data.tsv		  NIFTY50_2018.csv	planets_new.txt       zeros.npz
many_arrs_compressed.npz  NIFTY50_2019.csv	planets_small.txt
many_arrs.npz		  NIFTYNext50_2019.csv	planets.txt
nifty-200623-235920.csv   planets_new.npy	zeros_compressed.npz

In [58]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv')
nifty50_2018.head()

          Date      Open      High       Low     Close
0  31 Dec 2018  10913.20  10923.55  10853.20  10862.55
1  28 Dec 2018  10820.95  10893.60  10817.15  10859.90
2  27 Dec 2018  10817.90  10834.20  10764.45  10779.80
3  26 Dec 2018  10635.45  10747.50  10534.55  10729.85
4  24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [59]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv', index_col=0)
nifty50_2018.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [60]:
nifty50_2018.loc['31 Dec 2018']

Open     10913.20
High     10923.55
Low      10853.20
Close    10862.55
Name: 31 Dec 2018, dtype: float64

In [61]:
nifty50_2018['Open']

Date
31 Dec 2018    10913.20
28 Dec 2018    10820.95
27 Dec 2018    10817.90
26 Dec 2018    10635.45
24 Dec 2018    10780.90
                 ...
05 Jan 2018    10534.25
04 Jan 2018    10469.40
03 Jan 2018    10482.65
02 Jan 2018    10477.55
01 Jan 2018    10531.70
Name: Open, Length: 246, dtype: float64

In [62]:
nifty50_2019 = pd.read_csv('NIFTY50_2019.csv', index_col=0)
nifty50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [63]:
nifty50 = pd.concat([nifty50_2018, nifty50_2019])
nifty50.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [64]:
niftynext50_2019 = pd.read_csv('NIFTYNext50_2019.csv', index_col = 0)
niftynext50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  28495.00  28549.50  28270.25  28307.55
30 Dec 2019  28528.95  28612.95  28406.70  28484.85
27 Dec 2019  28354.50  28500.25  28319.90  28476.80
26 Dec 2019  28409.10  28435.25  28259.75  28280.25
24 Dec 2019  28423.70  28430.40  28318.75  28382.85

In [65]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1)
nifty_2019.head()

                 Open      High       Low  ...      High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...  28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...  28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...  28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...  28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...  28430.40  28318.75  28382.85

[5 rows x 8 columns]

In [66]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1,
                       keys=['nifty50', 'niftynext50'])
nifty_2019.head()

              nifty50                      ... niftynext50
                 Open      High       Low  ...        High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...    28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...    28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...    28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...    28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...    28430.40  28318.75  28382.85

[5 rows x 8 columns]

In [67]:
nifty_2019['nifty50'].loc['31 Dec 2019']

Open     12247.10
High     12247.10
Low      12151.80
Close    12168.45
Name: 31 Dec 2019, dtype: float64

In [68]:
print(nifty50_2018.shape, nifty50_2019.shape, nifty50.shape)

(246, 4) (245, 4) (491, 4)

In [69]:
print(nifty50_2019.shape, niftynext50_2019.shape, nifty_2019.shape)

(245, 4) (245, 4) (245, 8)